Repository: 84000/data-translation-memory
Catalog: toh26-v3.tmx
Source language: bo
Languages: en

source: ༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱརྱ་པྲཛྙཱ་པཱ་ར་མི་ཏཱ་སཱུརྱ་གརྦྷ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉི་མའི་སྙིང་པོ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: The Noble Great Vehicle Sūtra The Sūryagarbha Perfection of Wisdom Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱ་ན་ཆོས་ཀྱི་དགོན་པ་ན་དགེ་སློང་གི་དགེ་འདུན་རབ་ཏུ་མང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པ་ནས་འདུས་པ་ཚད་མེད་གྲངས་མེད་པ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing in a sacred grove in the country of Magadha together with a large saṅgha of monks and an immeasurable, incalculable number of bodhisattvas who had gathered from infinite buddhafields.

source: དེའི་ཚེ་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་འདུག་པ་དེ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བ་མཆིས་ཏེ།
en: Then the bodhisattva great being named Sūryaprabhāsa, who was in the assembly, got up from his seat, went to the Blessed One, and said to him, “Blessed One, I have come to the Tathāgata to ask a question.

source: བཅོམ་ལྡན་འདས་གནང་བའི་སྐབས་དབྱེ་བར་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed One, I request your permission to ask it.”

source: ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་ངས་བཤད་པར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་རབ་ཏུ་སྣང་བས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The Blessed One replied, “Ask me whatever you wish, and I will answer.”

source: །བཅོམ་ལྡན་འདས་ཐབས་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The bodhisattva Sūryaprabhāsa then asked the Blessed One, “How, Blessed One, should a bodhisattva who is skilled in means train in the perfection of wisdom?” “

source: །རིགས་ཀྱི་བུ་ཐབས་མཁས་པའི་ཏིང་ངེ་འཛིན་ཉི་མ་ཞེས་བྱ་བ་ཡོད་པས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Son of a good family,” replied the Blessed One, “there is a meditative stability that is skilled in means called the sun. Bodhisattvas should train in it.” “

source: །བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should they train in it?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: he asked the Blessed One. “

source: རིགས་ཀྱི་བུ་འདི་ལྟར་ཐབས་མཁས་པའི་ཉི་མའི་ཏིང་ངེ་འཛིན་ནི་རྣམ་པ་བདུན་ཡོད་དེ།
en: Son of a good family,” replied the Blessed One, “the meditative stability the sun skilled in means has seven aspects.

source: གང་ཞེ་ན་དང་པོ་ནི་འདི་ལྟར་ཉི་མས་མྱུ་གུ་སྨིན་པར་བྱེད་པ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཉི་མ་ལྟ་བུས་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་མྱུ་གུ་སྨིན་པར་མཛད་དོ།
en: What are they? First, just as the sun ripens a sprout, the bodhisattva’s sun-like meditative stability ripens the sprout of awakening in sentient beings.

source: །གཉིས་པ་ནི་ཉི་མ་དབྲི་བཀོལ་མེད་པ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཐུགས་རྗེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་མཛད་དོ།
en: Second, just as the sun never diminishes or dissipates, the compassion of the bodhisattva’s meditative stability acts equally for all sentient beings.

source: །གསུམ་པ་ནི་ཉི་མས་ཉལ་ཉིལ་སྲེག་པ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མཐོང་གི་ཤེས་རབ་ཀྱིས་ཉོན་མོངས་པའི་ཉལ་ཉིལ་རྣམས་སྲེག་པར་བྱེད་དོ།
en: Third, just as the sun burns dust, the bodhisattva’s wisdom of insight burns the dust of the defilements.

source: །བཞི་པ་ནི་ཉི་མས་འཁྱགས་པ་འཇུ་བ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གཉེན་པོ་ཡེ་ཤེས་དང་ལྡན་པས་ཉོན་མོངས་པ་འཁྱགས་པ་ལྟ་བུ་འཇུ་བར་བྱེད་དོ།
en: Fourth, just as the sun melts ice, the bodhisattva’s meditative stability, the antidote endowed with gnosis, melts the ice-like defilements.

source: །ལྔ་པ་ནི་ཉི་མས་མུན་པ་སེལ་བ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་ཀུན་ཏུ་རྟོག་པའི་ཡེ་ཤེས་ཀྱིས་གཟུང་བ་དང་འཛིན་པའི་མུན་པ་སེལ་བར་བྱེད་དོ།
en: Fifth, just as the sun dispels darkness, the bodhisattva’s discriminating gnosis dispels the darkness of grasped objects and grasping subjects.

source: །དྲུག་པ་ནི་ཉི་མས་གླིང་བཞི་འཁོར་བ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཕྲིན་ལས་ཕུན་སུམ་ཚོགས་པས་སྡུག་བསྔལ་གྱི་ཆུ་བོ་བཞི་ལས་ཐར་བར་མཛད་དོ།
en: Sixth, just as the sun revolves around the four continents, the bodhisattva’s perfect activity liberates from the four torrents of suffering.

source: །བདུན་པ་ནི་ཉི་མས་ཀུན་ལ་སྙོམས་པར་དྲོ་བ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་རབ་ཏུ་དགའ་བར་མཛད་པའི་ཐབས་ནི་དྲོ་བའི་ལས་ལྟ་བུའོ།
en: Seventh, just as the sun warms everything equally, the means that is the bodhisattva’s perfect conduct, which gladdens all sentient beings, is like that act of warming. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱ་སྟེ། དེས་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་བཞིན་མེད་པ་དང་། མཚན་མ་མེད་པ་དང་། མཚན་མ་ཐམས་ཅད་དང་རབ་ཏུ་བྲལ་བ་དང་།
en: Furthermore, son of a good family, bodhisattvas should train in the perfection of wisdom.

source: དངོས་པོ་མེད་པ་དང་། དངོས་པོ་ཐམས་ཅད་དང་བྲལ་བ་དང་། གང་ཟག་པ་མེད་པ་དང་། གང་ཟག་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བྱའོ།
en: They should train in the fact that all phenomena are without inherent existence, are signless, are totally devoid of all signs, are nonentities, are devoid of all entities, are that which is uncontaminated, are that which is devoid of all contamination, and are empty in their essential nature. “

source: །རིགས་ཀྱི་བུ་ཆོས་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། བདེན་པ་དང་དེ་ཁོ་ནའི་དོན་ལ་བྱང་ཆུབ་སེམས་དཔས་བསླབ་པར་བྱའོ།
en: Son of a good family, bodhisattvas should train in the meaning of reality, the realm of phenomena, the real nature, the very limit of reality, the unmistaken real nature, the one and only real nature, the truth, and thusness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་རབ་ཏུ་སྣང་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ས་ཡང་ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་ལ་བསླབ་པར་བྱའོ།
en: Then the Blessed One said to the bodhisattva Sūryaprabhāsa, “Son of a good family, bodhisattvas should also train in the fact that all phenomena are without conditioning and without arising.

source: །རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ལ་བསླབ་པར་བྱའོ།
en: Son of a good family, they should train in the fact that all phenomena are naturally pure.

source: །གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་ཤེས་པར་བྱའོ། །ངོ་བོ་ཉིད་ཀྱིས་དབེན་པར་ཤེས་པར་བྱའོ།
en: They should know that all phenomena, such as form and so on, are naturally empty; they should know that they are void in their essential nature. “

source: །རིགས་ཀྱི་བུ་གང་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་འཛིན་པར་བྱེད་ན་དེ་ལས་ཀྱི་སྒྲིབ་པ་བྱང་བར་འགྱུར་རོ། །དེ་བསོད་ནམས་ཀྱི་ཚོགས་སྐྱེ་བར་འགྱུར་རོ། །ཤེས་རབ་ཀྱི་ཚོགས་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །དྲན་པ་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཏིང་ངེ་འཛིན་དང་ལྡན་པར་འགྱུར་རོ།
en: Son of a good family, someone who takes up the Perfection of Wisdom sūtra will purify karmic obscurations; the accumulation of merit will arise; they will come to possess an immeasurable accumulation of wisdom; and they will come to possess mindfulness, ethical discipline, and meditative stability.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །མང་ཐོས་དམ་པའི་ཆོས་ལ་བརྩོན།
en: Son of a good family, bodhisattvas should also train in the perfection of wisdom.”

source: །སེམས་ཅན་ཀུན་ལ་བྱམས་པར་ལྡན། །བརྩོན་འགྲུས་གོ་ཆ་ཕུན་སུམ་ཚོགས། །བདག་དང་གཞན་གྱི་དོན་ལ་མོས། །བསམ་གཏན་ཏིང་འཛིན་བསྒོམ་ལ་བརྩོན། །བདག་དང་སེམས་ཅན་འདུ་ཤེས་མེད། །ཡང་དག་ཐེག་པའི་ལམ་དུ་ཞུགས། །སྔོན་གྱི་རྒྱལ་སྲས་དེ་ལྟར་སྤྱོད། །མཁས་པས་མ་ནོར་དེ་བཞིན་སློབས།
en: At that point, the Blessed One recited this verse: “Exertion in erudition and the holy Dharma, Having loving kindness for all sentient beings, Possessing the armor of perseverance, Devotion to the purposes of self and others, Exertion in cultivating meditative concentration and stability, Being without perceptions of self and sentient beings, Practicing like the previous children of the victors— The wise unmistakably train thus.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་རབ་ཏུ་སྣང་བ་དང་། ལྷ་དང་མིར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: After the Blessed One had spoken, the bodhisattva Sūryaprabhāsa, and the world with its gods and humans, rejoiced and praised what the Blessed One had said.

source: །འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉི་མའི་སྙིང་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Great Vehicle sūtra “The Sūryagarbha Perfection of Wisdom.”
